const fjEData = {
    colorList: ['#4D94FF', '#A49DFA', '#FC809F', '#FFD98C', '#8AE6C7', '#E19564', '#BF6E9B', '#CECE7E', '#91C2F2', '#B7C8EA', '#FF9F7F', '#91C2F2', '#B380B6', '#EDA8AD', '#738AD4', '#FF9F7F'],
    colorList1: ['#4D94FF', '#A49DFA', '#FC809F', '#FFD98C', '#8AE6C7', '#E19564', '#BF6E9B', '#CECE7E', '#91C2F2', '#B7C8EA', '#FF9F7F', ],
    box0Data: {
        name: ['快手', '小红书'],
        value: [55, 45],
    },
    box01Data: {
        name: ['快手', '小红书', '头条'],
        value: [55, 45, 78],
    },
    box1Data: {
        name: ['26-30岁', '31-35岁', '41-45岁', '21-25岁', '18-20岁', '36-40岁'],
        value: [528, 464, 958, 423, 123, 400],
    },
    box2Data: {
        name: ["11001-13000元", "10001-11001元", "13001-15000元", "7001-10000元", "5000元以下", "5000-7000元", "15001-17000元", "17001-20000元", "20001-30000元", "30001-50000元", "50000元以上", ],
        value: [30, 44, 52, 21, 48, 35, 34, 55, 63, 71, 81],
    },
    box3Data: {
        name: ['中层管理者', '公司白领', '自由职业者', '全职太太', '高层管理', '其他'],
        value: [23, 29, 40, 31, 23, 18],
    },
    box4Data: {
        name: ['无', '有'],
        value: [75, 25],
    },
    box5Data: {
        name: ['女', '男'],
        value: [75, 25],
    },
    box6Data: {
        name: ['喜好', '厌恶', '一般', '创伤'],
        value: [25, 25, 25, 25],
    },
    box7Data: {
        name: ['小红书', '抖音', '微博', '快手', 'bilibili'],
        value: [33, 118, 89, 59, 41],
    },
    box8Data: {
        name: ['放松休闲', '工作加班', '其他活动', '通勤', '休息'],
        value: [38, 19, 17, 16, 10],
    },
    box9Data: {
        name: ['大众点评', '抖音', '微博', '公众号', '新浪微博', '微信社区'],
        value: [38, 5, 42, 2, 9, 5],
    },
    box10Data: {
        name: ['碳酸类', '果汁类', '乳酸类', '功能饮料', '饮用水', '茶类', '咖啡类'],
        value: [19, 13, 9, 11, 23, 16, 9],
    },
    box11Data: {
        name: ['四口之家', '五口之家', '单身与父母一起住', '俩口之家', '三口之家'],
        value: [17, 10, 18, 30, 35],
    },
    box12Data: {
        name: ['<25岁', '35-45岁', '>56岁', '26-34岁', '46-55岁'],
        value: [57, 20, 10, 8, 5],
    },
    box13Data: {
        name: ['已覆盖目标受众', '未覆盖目标受众'],
        value: [72, 50],
    },
    box14Data: {
        name: ['覆盖度', '认可度', '匹配度', '占据力', '忠诚度', '传播度'],
        value: [
            [80, 50, 55, 80, 50, 80, 48, 43],
            [60, 60, 65, 60, 70, 40, 80, 63]
        ],
    },
    box30Data: {
        name: ['公信力', '转化度', '信息量', '专业度', 'ROI', '友好度'],
        value: [
            [80, 50, 55, 80, 50, 80, 48, 43],
            [60, 60, 65, 60, 70, 40, 80, 63]
        ],
    },
    box15Data: {
        name: ['职业匹配度', '婚恋状态匹配度', '年龄匹配度', '收入匹配度', '教育程度匹配度'],
        value: [94.3, 74.5, 98.2, 88.7, 86.9],
    },
    box16Data: {
        name: [],
        value: [3, 10],
    },
    box17Data: {
        name: ['应对速度', '应对态度', '应对技巧', '应对信息质量', '动态发布', '防止再炒作', '公信力修复', '专业认可度', '集体认可度', '网友认可度'],
        value: 0.12,
    },
    box18Data: {
        name: [
            ['新式茶', '混合茶', '传统萃取'],
            ['新式茶', '混合茶', '传统萃取']
        ],
        value: [
            [50, 10, 10],
            [50, 10, 10],
            [
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806],
                [6.9, 178336, 36496, 6806]
            ]
        ],
    },
    box19Data: {
        name: ['应对速度', '应对态度', '应对技巧', '应对信息质量', '动态发布', '防止再炒作', '公信力修复', '专业认可度', '集体认可度', '网友认可度'],
        value: [5, 4, 5, 7, 5, 8, 4, 7, 7, 8],
    },
    box20Data: {
        name: ['低购买力', '中购买力', '高购买力'],
        value: [15, 30, 55],
    },
    box21Data: {
        name: ['朝阳区', '海淀区', '东城区', '西城区', '通州区', '其他'],
        value: [23, 29, 40, 31, 23, 18],
    },
    box22Data: {
        name: ['亲友聚会', '运动', '过节送礼'],
        value: [55, 30, 5],
    },
    box31Data: {
        name: ['短视频', '直播', '录播'],
        value: [80, 80, 140],
        title: '最大内容方向：录播'
    },
    box32Data: {
        name: ['短视频', '直播', '录播'],
        value: [78, 130, 60],
        title: '最大内容方向：直播'
    },
    box33Data: {
        name: ['短视频', '直播', '录播'],
        value: [95, 65, 25],
        title: '最大内容方向：短视频'
    },
    box34Data: {
        name: ['真粉丝',  '僵尸粉'],
        value: [6500, 500],
        title: '7000w'
    },
    box35Data: {
        name: ['真粉丝',  '僵尸粉'],
        value: [5000, 1690],
        title: '6690w'
    },
    box36Data: {
        name: ['真粉丝',  '僵尸粉'],
        value: [5800, 1000],
        title: '6800w'
    },
    box37Data: {
        name: ['广告', '直播','短视频'],
        value: [40, 60, 74],
        title: '最大曝光分布：短视频'
    },
    box38Data: {
        name: ['广告', '直播','短视频'],
        value: [70, 90, 80],
        title: '最大曝光分布：直播'
    },
    box39Data: {
        name: ['广告', '直播','短视频'],
        value: [95, 82, 60],
        title: '最大曝光分布：广告'
    },
    box40Data: {
        name: ['食品类', '快消品', '电子产品', '运动户外'],
        value: [100, 20, 60, 80],
        title: '最大销售分布：食品类'
    },
    box41Data: {
        name: ['食品类', '快消品', '电子产品', '运动户外'],
        value: [90, 128, 60, 70],
        title: '最大销售分布：快消品'
    },
    box42Data: {
        name: ['食品类', '快消品', '电子产品', '运动户外'],
        value: [75, 80, 105, 90],
        title: '最大销售分布：电子产品'
    },
}
export default fjEData;